Run in batch mode on rsch102
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 75-user 8-core network, expiring  1 Sep 2021
Serial number: 501609205717
  Licensed to: CISER
               Cornell University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do U:/Documents/AEA_Workspace/Statapackagesearch/performance.do 

. // https://stackoverflow.com/questions/7924702/looking-for-a-sample-program-t
> o-test-stata-mp
. 
. set more off

. cap set processors 8

. clear*

. set rmsg on
r; t=0.00 21:43:12

. global size 10000000
r; t=0.00 21:43:12

. global dims 5
r; t=0.00 21:43:12

. global reps 200
r; t=0.00 21:43:12

. 
. set obs     $size
number of observations (_N) was 0, now 10,000,000
r; t=0.03 21:43:12

. forval n = 1/$dims {
  2. g i`n' = runiform()
  3. }
r; t=4.45 21:43:16

. g dv = rbinomial(1,.3)
r; t=1.51 21:43:18

. memory

  Memory usage
                                            used                allocated
    ---------------------------------------------------------------------
    data                             240,000,000              301,989,888
    strLs                                      0                        0
    ---------------------------------------------------------------------
    data & strLs                     240,000,000              301,989,888

    ---------------------------------------------------------------------
    data & strLs                     240,000,000              301,989,888
    var. names, %fmts, ...                 1,954                   65,000
    overhead                          21,004,344               21,005,080

    Stata matrices                             0                        0
    ado-files                              3,263                    3,263
    stored results                             0                        0

    Mata matrices                              0                        0
    Mata functions                             0                        0

    set maxvar usage                   5,281,738                5,281,738

    other                                  3,601                    3,601
    ---------------------------------------------------------------------
    grand total                      266,290,872              328,348,570
r; t=0.00 21:43:18

. 
. // r; m=logit
. qui logit dv i*
r; t=13.48 21:43:31

. // r; m=xtmixed
. qui xtmixed dv i*
r; t=50.96 21:44:22

. 
. *with bootstrap:
. // r; m=bootstrap
. qui bs, reps($reps): logit dv i*
r; t=7627.19 23:51:30

. 
. exit, clear

end of do-file
r; t=0.00 23:51:30
